In [5]:
# Ask And Answer (Python Pandas学习群: 366719470) 
# AAA001

In [6]:
import pandas as pd
import numpy as np
import re

In [7]:
df = pd.read_excel('AAA001.xlsx', header=None)
df

       0
0   4566
1      D
2      B
3      C
4   3344
5     AS
6     DF
7     GH
8   7788
9     QW
10    RT

In [10]:
df[0] = df[0].astype(str)
df[1] = df[0].apply(
    lambda x: 1 if re.match(r'\d.', x) else 0)
df

       0  1
0   4566  1
1      D  0
2      B  0
3      C  0
4   3344  1
5     AS  0
6     DF  0
7     GH  0
8   7788  1
9     QW  0
10    RT  0

In [11]:
df[2] = df[1].cumsum()
df

       0  1  2
0   4566  1  1
1      D  0  1
2      B  0  1
3      C  0  1
4   3344  1  2
5     AS  0  2
6     DF  0  2
7     GH  0  2
8   7788  1  3
9     QW  0  3
10    RT  0  3

In [14]:
df[3] = df.groupby(2)[0].transform(
    lambda x: '-'.join(x.iloc[1:])
)
df

       0  1  2         3
0   4566  1  1     D-B-C
1      D  0  1     D-B-C
2      B  0  1     D-B-C
3      C  0  1     D-B-C
4   3344  1  2  AS-DF-GH
5     AS  0  2  AS-DF-GH
6     DF  0  2  AS-DF-GH
7     GH  0  2  AS-DF-GH
8   7788  1  3     QW-RT
9     QW  0  3     QW-RT
10    RT  0  3     QW-RT

In [15]:
df[4] = np.where(df[1] == 1, df[3], '')
df

       0  1  2         3         4
0   4566  1  1     D-B-C     D-B-C
1      D  0  1     D-B-C
2      B  0  1     D-B-C
3      C  0  1     D-B-C
4   3344  1  2  AS-DF-GH  AS-DF-GH
5     AS  0  2  AS-DF-GH
6     DF  0  2  AS-DF-GH
7     GH  0  2  AS-DF-GH
8   7788  1  3     QW-RT     QW-RT
9     QW  0  3     QW-RT
10    RT  0  3     QW-RT

In [16]:
df = df[[0, 4]]
df

       0         4
0   4566     D-B-C
1      D
2      B
3      C
4   3344  AS-DF-GH
5     AS
6     DF
7     GH
8   7788     QW-RT
9     QW
10    RT